---
kind: type
id: T:Autodesk.Revit.DB.VertexIndexPair
source: html/8deec2c5-1ef4-5951-6745-259b6514c46b.htm
---
# Autodesk.Revit.DB.VertexIndexPair

Represents a connection between vertices in the top and bottom profile of a blend.

## Syntax (C#)
```csharp
public class VertexIndexPair
```

## Remarks
Use objects of this type in GetVertexConnectionMap () () () ,
 SetVertexConnectionMap(VertexIndexPairArray) ,
 GetVertexConnectionMap () () () and
 SetVertexConnectionMap(VertexIndexPairArray) to get/set the vertex connection map.